БухЭксп/InformationRegisters/CW_ДоступныеСправочникиПоГруппамПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДоступныеСправочникиПоГруппамПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ГруппаПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОбъектыОграниченийДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОбъектыОграниченийДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВладелецОбъектаДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДоступныеСправочникиПоГруппамПользователей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция РедактированиеОбъектаЗапрещено(ИмяОбъектаМетаданных, ГруппаПользователя = Неопределено) Экспорт
	
	Если ГруппаПользователя = Неопределено Тогда
		ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());
	КонецЕсли;
	
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь() 
								ИЛИ ГруппаПользователя.ПолныеПрава 
								ИЛИ ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы;
	
	Если ЭтоПолноправныйПользователь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ИмяОбъектаМетаданных);
	
	//Проверяем, чта на этот справочник настроены ограничения
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ОбъектыОграниченийДоступа.ИдентификаторОбъектаМетаданных КАК ИдентификаторОбъектаМетаданных
	               |ИЗ
	               |	РегистрСведений.CW_ОбъектыОграниченийДоступа КАК CW_ОбъектыОграниченийДоступа
	               |ГДЕ
	               |	CW_ОбъектыОграниченийДоступа.ИдентификаторОбъектаМетаданных = &ИдентификаторОбъектаМетаданных";
	
	Запрос.УстановитьПараметр("ИдентификаторОбъектаМетаданных", ИдентификаторОбъектаМетаданных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		//Для объекта нет ограничений
		Возврат Ложь;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ДоступныеСправочникиПоГруппамПользователей.ГруппаПользователя КАК ГруппаПользователя,
	               |	CW_ДоступныеСправочникиПоГруппамПользователей.ИдентификаторОбъектаМетаданных КАК ИдентификаторОбъектаМетаданных
	               |ИЗ
	               |	РегистрСведений.CW_ДоступныеСправочникиПоГруппамПользователей КАК CW_ДоступныеСправочникиПоГруппамПользователей
	               |ГДЕ
	               |	CW_ДоступныеСправочникиПоГруппамПользователей.ГруппаПользователя = &ГруппаПользователя
	               |	И CW_ДоступныеСправочникиПоГруппамПользователей.ИдентификаторОбъектаМетаданных = &ИдентификаторОбъектаМетаданных";
	
	Запрос.УстановитьПараметр("ГруппаПользователя", ГруппаПользователя);
	Запрос.УстановитьПараметр("ИдентификаторОбъектаМетаданных", ИдентификаторОбъектаМетаданных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции


//Служебные процедуры
Процедура КонвертироватьРеквизитыГрупыПользователйВРегистр() Экспорт
	
	МассивИменРеквизитов = ПолучитьМассивИменРеквизитовГруппыПользователей();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ГруппыПользователей.Ссылка КАК Ссылка,
	               |	CW_ГруппыПользователей.ПолныеПрава КАК ПолныеПрава
	               |ИЗ
	               |	Справочник.CW_ГруппыПользователей КАК CW_ГруппыПользователей";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого ИмяРеквизита из МассивИменРеквизитов Цикл
			Если Выборка.ПолныеПрава Тогда
				ЗначениеРеквизита = Истина;
			Иначе
				ЗначениеРеквизита = Выборка.Ссылка[ИмяРеквизита];
			КонецЕсли;
			
			Если ЗначениеРеквизита Тогда
				ЗаписатьИдентификаторОбъектаВРегистр(Выборка.Ссылка, ИмяРеквизита);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры  

Процедура ЗаписатьИдентификаторОбъектаВРегистр(ГруппаПользователя, ИмяРеквизита)
	
	ИмяОбъекта = СтрЗаменить(ИмяРеквизита,"УДАЛИТЬРедактирование_","");
	
	МетаданныеОбъекта = Метаданные.Справочники.Найти(ИмяОбъекта);	
	Если МетаданныеОбъекта= Неопределено ТОгда
		МетаданныеОбъекта = Метаданные.Документы.Найти(ИмяОбъекта);	
	КонецЕсли;;
	Если МетаданныеОбъекта= Неопределено ТОгда
		МетаданныеОбъекта = Метаданные.РегистрыСведений.Найти(ИмяОбъекта);	
	КонецЕсли;
	
	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(МетаданныеОбъекта.ПолноеИмя(), Ложь);
	
	Если ИдентификаторОбъектаМетаданных <> Null Тогда
		ЗаписьРегистра = РегистрыСведений.CW_ДоступныеСправочникиПоГруппамПользователей.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.ГруппаПользователя 			  =	ГруппаПользователя;
		ЗаписьРегистра.ИдентификаторОбъектаМетаданных = ИдентификаторОбъектаМетаданных;
		ЗаписьРегистра.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМассивИменРеквизитовГруппыПользователей()
	
	Результат = Новый Массив;
	
	Для Каждого Реквизит из Метаданные.Справочники.CW_ГруппыПользователей.Реквизиты Цикл
		Если СтрНачинаетсяС(Реквизит.Имя, "УДАЛИТЬРедактирование_") Тогда
			Результат.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
//Служебные процедуры
#КонецЕсли
